Revit 2026 API

# PrintManagerPrintToFileName Property

---

The file name when printing to file.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string PrintToFileName { get; set; }
```
```vb
Public Property PrintToFileName As String
	Get
	Set
```
```cpp
public:
property String^ PrintToFileName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member PrintToFileName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input file name is . |
| ArgumentException | Thrown when the input file name is an invalid string. |

A default file name will be used when the PrintToFile is true and PrintToFileName is not be set.

The value of this property represents the global print setting property used for print operations on any document. In order to make a change to this property, after setting it call the Apply() method, or one of the SubmitPrint() methods, which save the local changes as modifications to the global print settings.

#### Reference

PrintManager Class

Autodesk.Revit.DB Namespace